
 #Область ПрограммныйИнтерфейс

//Добавляет интерактивно на форму реквизиты
Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьПолеСогласованнаяСкидкаВГруппаСкидка(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс 

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма) Экспорт
	
	ПолеВвода = Форма.Элементы.Добавить("НЕТО_КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.НЕТО_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма) Экспорт
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.НЕТО_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ДобавитьПолеСогласованнаяСкидкаВГруппаСкидка(Форма) Экспорт
	
	// Группа Скидки - не добавляется на форме и при ссылке на нее при добавлении ПоляВвода - ошибка
	
	//ГруппаСкидки = Форма.Элементы.Добавить("НЕТО_ГруппаСкидка", Тип("ГруппаФормы"),Форма.Элементы.ГруппаШапкаЛево);
	//ГруппаСкидки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//ГруппаСкидки.ОтображатьЗаголовок = Истина;
	//ГруппаСкидки.Заголовок = "Группа скидки";
	//ГруппаСкидки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	
	//добавление элемента Формы
	ПолеВвода = Форма.Элементы.Добавить("НЕТО_СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.НЕТО_СогласованнаяСкидка";
	ПолеВвода.УстановитьДействие("ПриИзменении","НЕТО_НЕТО_СогласованнаяСкидкаПриИзменении");
	
	//добавление команды
	Команда = Форма.Команды.Добавить("НЕТО_ПересчитатьТаблицу");
	Команда.Заголовок = "Пересчитать таблицу";
	Команда.Картинка = БиблиотекаКартинок.Перечитать;
	Команда.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Команда.Действие = "НЕТО_ПересчитатьТаблицу";
	//добавление элемента Формы
	Кнопка = Форма.Элементы.Добавить("НЕТО_ПересчитатьТаблицу", Тип("КнопкаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	Кнопка.ИмяКоманды = "НЕТО_ПересчитатьТаблицу";

	
КонецПроцедуры

#КонецОбласти


